# -*- org-src-preserve-indentation: t; org-edit-src-content: 0; org-confirm-babel-evaluate: nil; -*-
# NOTE: `org-src-preserve-indentation: t; org-edit-src-content: 0;` are options to ensure indentations are preserved for export to ipynb.
# NOTE: `org-confirm-babel-evaluate: nil;` means no confirmation will be requested before executing code blocks

#+TITLE: EBSD Mapping
* Euler Orientations to RGB Vectors
The orientations are recorded as Euler angles, which are rotations about 3 mutually orthogonal axes. The specific directions are difficult to determine without a specification. However, the definition of euler angles requires that two of them take a range over $2\pi$ radians and the one takes a range over $\pi$ radian.

One way of mapping all three angles within one pixel is using RGB bands, such that each band is assigned to rotation about each axis. The colormap reference can then be displayed in a ternary plot. For the RGB bands to work, the angles must be normalized to range [0,1]. To determine the method of normalization, the range of each Euler angle must first be determined. In the absence of a specification in the metadata, this can be performed by inspecting the minimum and maximum data values.

#+BEGIN_SRC python :session py :results output
for i in range(1,4):
    euler_angle = "Euler%u" % i
    data = df[euler_angle]
    print(euler_angle,min(data),max(data))
#+END_SRC

#+RESULTS:
: Euler1 0.0 359.94
: Euler2 0.0 59.163
: Euler3 0.0 359.96

From this analysis, it seems that Euler1 and Euler3 are the angles with range $2\pi$ radians between 0 and 360 degrees, and Euler2 is the angle with range $\pi$ radian between 0 and 180 degrees (though the upper limit does not seem to have been reached, implying non-randomness of the distribution of rotations about the second Euler pole). Since the lower ends of these angles are all zero, normalization simply involves division of each angle by the range size (in degrees).

#+BEGIN_SRC python :session py
R_band = df["Euler1"]/360
G_band = df["Euler2"]/180
B_band = df["Euler3"]/360
#+END_SRC

#+RESULTS:

This 1D data can then be converted into a suitably 2D map using the grid size extracted from the metadata, and then combined into a map of RGB color vectors.

#+BEGIN_SRC python :session py
image_R = R_band.to_numpy().reshape(y_cells,x_cells)
image_G = G_band.to_numpy().reshape(y_cells,x_cells)
image_B = B_band.to_numpy().reshape(y_cells,x_cells)

# Combine the bands into a 2D array of RGB vectors.
combined_img = np.stack([image_R,image_G,image_B],axis=2)
#+END_SRC

#+RESULTS:

